<script setup lang="ts">

import {AmthauerStrings} from './constants/AmthauerStrings';
</script>

<template>
  <q-card class="amthauer__card_style">
    <q-card-section>
      <div class="text-h6">{{ AmthauerStrings.history }}</div>
    </q-card-section>
    <q-separator />

    <q-card-section>
      <div class="row q-col-gutter-md">
        <div class="col-12">
          <p class="text-h6">История Рудольфа Амтхауэра и для чего нужен его тест IQ</p>
          <p>
            <b>Рудольф Амтхауэр</b> был немецким психологом и пионером в области измерения интеллекта. В начале XX века он разработал и внедрил тест IQ, который предназначен для оценки уровня интеллекта человека.
          </p>
          <p>
            История Рудольфа Амтхауэра связана с его стремлением разработать систему измерения, которая могла бы количественно оценить интеллектуальные способности людей. В 1905 году он создал первый формальный тест IQ, известный как Binet-Simon Scale, основанный на работе французских психологов Альфреда Бине и Теодора Симона.
          </p>
          <p>
            Целью теста IQ было определить интеллектуальные способности человека в сравнении с его хронологическим возрастом. Это помогало идентифицировать отклонения в развитии и проблемы обучения. Тест включал различные задания, такие как решение логических задач, заполнение пропущенных элементов рисунков, аналогии и другие.
          </p>
          <p>
            Тест IQ Амтхауэра получил широкое признание и использовался в практике психологии и образования. Он позволял определить уровень когнитивных способностей и установить интеллектуальные преимущества и слабости индивидов. Кроме того, тест IQ использовался для определения подходящих образовательных программ и разработки индивидуальных планов обучения.
          </p>
          <p>
            Создание теста IQ Рудольфом Амтхауэром сыграло значительную роль в психологии и образовании. Этот инструмент продолжает использоваться в настоящее время, хотя были разработаны и другие методы измерения интеллекта. Тест IQ помогает оценить когнитивные способности людей и обеспечить более эффективное обучение и развитие.
          </p>
        </div>
      </div>

    </q-card-section>

  </q-card>
</template>

<style scoped>

</style>
